# 1: create any list from you 2D List-to-Dataframe Conversion Given a 2D List, convert it into corresponding dataframe and display it.

In [1]:
import pandas as pd
data = [
    ['Mo', 28, 'Doctor'],
    ['Emma', 30, 'Artist'],
    ['Maged', 25, 'Lawyer']
]

df = pd.DataFrame(data, columns=['Name', 'Age', 'Job'])
df

    Name  Age     Job
0     Mo   28  Doctor
1   Emma   30  Artist
2  Maged   25  Lawyer

# 2: create any dic from you then Dictionary-to-Dataframe ConversionGiven a dictionary, convert it into corresponding dataframe and display it

In [2]:
data = {
    "Name": ["Ahmed", "Bassant", "Careem", "Doha"],
    "Age": [20, 21, 22, 23],
    "Grade": ["A", "B", "C", "B"]
}
df2 = pd.DataFrame(data)
df2

      Name  Age Grade
0    Ahmed   20     A
1  Bassant   21     B
2   Careem   22     C
3     Doha   23     B

# 3:Selecting all the rows from the given dataframe in which ‘Percentage’ is greater than 80 using basic method.

record = {
  
 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 
 'Age': [21, 19, 20, 18, 17, 21],
 
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 
 'Percentage': [88, 92, 95, 70, 65, 78] }

columns = ['Name', 'Age', 'Stream', 'Percentage']

In [3]:
record = {
    'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya'],
    'Age': [21, 19, 20, 18, 17, 21],
    'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
    'Percentage': [88, 92, 95, 70, 65, 78]
}

df = pd.DataFrame(record)
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [4]:
filtered_df = df[df['Percentage'] > 80]
filtered_df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95